Project/Toir/src/Catalogs/ПравилаИнтеграцииС1СДокументооборотом/ПравилаИнтеграцииС1СДокументооборотом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаИнтеграцииС1СДокументооборотом</name>
  <attributes>
    <name>ТипОбъектаПотребителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаДокументооборота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФайловСохраненияПечатныхФорм</name>
    <type>
      <types>EnumRef.ТипыФайловСохраненияПечатныхФормОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЗапрещаетИзменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПрименимостиПриВыгрузке</name>
    <comment>Выражение на встроенном языке, определяющее применимость правила при выгрузке в 1С:Документооборот</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПрименимостиПриЗагрузке</name>
    <comment>Выражение на встроенном языке, определяющее применимость правила при загрузке из 1С:Документооборота</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъектаПотребителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъектаДокументооборота</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьСвязиПоСсылкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПравилаЗаполненияРеквизитовПриВыгрузке</name>
    <attributes>
      <name>ИмяРеквизитаОбъектаДокументооборота</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПравилаЗаполненияРеквизитов</name>
      <type>
        <types>EnumRef.ВариантыПравилЗаполненияРеквизитов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаОбъектаПотребителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизитаДокументооборота</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторЗначенияРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычисляемоеВыражение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитОбъекта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитОбъектаСвойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборота</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборотаID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборотаТип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбновлятьЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполненВШаблоне</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключевой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонТип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаЗаполненияРеквизитовПриЗагрузке</name>
    <attributes>
      <name>ИмяРеквизитаОбъектаПотребителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПравилаЗаполненияРеквизитов</name>
      <type>
        <types>EnumRef.ВариантыПравилЗаполненияРеквизитов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаОбъектаДокументооборота</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизитаПотребителя</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычисляемоеВыражение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборота</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборотаID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборотаТип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитОбъекта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитОбъектаСвойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбновлятьЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключевой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимИзмененияДанныхПроведенногоДокумента</name>
      <type>
        <types>EnumRef.РежимИзмененияПроведенногоДокументаДанными1СДокументооборота</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрисоединяемыеПечатныеФормы</name>
    <attributes>
      <name>МенеджерПечати</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКоманды</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеКоманды</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбновлятьЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/ПравилаИнтеграцииС1СДокументооборотом/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СокращенноеНаименованиеКонфигурации = ИнтеграцияС1СДокументооборот.СокращенноеНаименованиеКонфигурации();
	Если ЗначениеЗаполнено(СокращенноеНаименованиеКонфигурации) Тогда
		Элементы.ПредставлениеОбъектаПотребителя.Заголовок 
			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("es='El objeto %1';ru='Объект %1';en='Object %1'"), СокращенноеНаименованиеКонфигурации);
	КонецЕсли;
			
	Если ЗначениеЗаполнено(Параметры.ТипОбъектаПотребителя) Тогда
		ТипОбъектаПотребителя = Параметры.ТипОбъектаПотребителя;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
			"ТипОбъектаПотребителя",
			ТипОбъектаПотребителя,
			ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ПоказатьУдаленные.Пометка = ПоказыватьУдаленные;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"ПометкаУдаления",
		Ложь,
		ВидСравненияКомпоновкиДанных.Равно,,
		Не ПоказыватьУдаленные,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьУдаленные(Команда)
	
	ПоказыватьУдаленные = Не ПоказыватьУдаленные;
	Элементы.ПоказатьУдаленные.Пометка = ПоказыватьУдаленные;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"ПометкаУдаления",
		Ложь,
		ВидСравненияКомпоновкиДанных.Равно,,
		Не ПоказыватьУдаленные,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(ТипОбъектаПотребителя) Тогда
		ПараметрыФормы.Вставить("ТипОбъектаПотребителя", ТипОбъектаПотребителя);
	КонецЕсли;
	Если Копирование Тогда
		ПараметрыФормы.Вставить("ЗначениеКопирования", Элементы.Список.ТекущаяСтрока);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ПравилаИнтеграцииС1СДокументооборотом.Форма.ФормаЭлемента",
		ПараметрыФормы,
		Элементы.Список);
	
КонецПроцедуры

#КонецОбласти
